{
  "posts": [
    {
      "id": 1,
      "title": "Introdução ao React",
      "body": "Aprenda os fundamentos do React, uma das bibliotecas JavaScript mais populares para construção de interfaces."
    },
    {
      "id": 2,
      "title": "Componentes em React",
      "body": "Os componentes são o coração do React. Aprenda como criar componentes reutilizáveis e eficientes."
    },
    {
      "id": 3,
      "title": "Estado e Ciclo de Vida",
      "body": "Entenda o estado do componente e o ciclo de vida para construir aplicações reativas."
    },
    {
      "id": 4,
      "title": "Hooks no React",
      "body": "Os Hooks proporcionam uma nova forma de usar estado e outras características do React sem escrever classes."
    },
    {
      "id": 5,
      "title": "React e Redux",
      "body": "Integre o Redux ao seu aplicativo React para gerenciar o estado global de maneira eficiente."
    },
    {
      "id": 6,
      "title": "Roteamento com React Router",
      "body": "Adicione roteamento à sua aplicação React para criar single-page applications (SPA) com eficiência."
    },
    {
      "id": 7,
      "title": "Testando Componentes React",
      "body": "Aprenda a escrever testes robustos para seus componentes e garantir que sua aplicação funcione como esperado."
    },
    {
      "id": 8,
      "title": "Performance em React",
      "body": "Dicas e truques para otimizar a performance do seu aplicativo React e proporcionar uma experiência suave para os usuários."
    },
    {
      "id": 9,
      "title": "Props e Estados",
      "body": "Nona entrada da nossa lista de posts de exemplo."
    },
    {
      "id": 10,
      "title": "Custom Hooks",
      "body": "Metade do caminho, este é o post número 10!"
    },
    {
      "id": 11,
      "title": "Context API",
      "body": "O post número 11 traz novos insights e detalhes."
    },
    {
      "title": "Server-side rendering com React",
      "body": "Descubra os benefícios do server-side rendering com React e como ele pode melhorar a performance e SEO(search engine optimization) do seu aplicativo.",
      "id": 12
    }
  ]
}